Res-firecracker-random-in2-v8/firecracker_t_4_c_6_frontVcpu_2_wrkVcpu_1/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5116.911ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5146.705ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5129.645ms, rate sampling interval: 18169ms
  Thread calibration: mean lat.: 5106.376ms, rate sampling interval: 18055ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    29.66s    11.55s    0.95m    65.38%
    Req/Sec   267.00      2.50   271.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.56s 
 75.000%   34.67s 
 90.000%   49.22s 
 99.000%    0.95m 
 99.900%    0.97m 
 99.990%    0.97m 
 99.999%    0.97m 
100.000%    0.97m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9920.511     0.000000            1         1.00
   14942.207     0.100000         5361         1.11
   19906.559     0.200000        10709         1.25
   24526.847     0.300000        16073         1.43
   25673.727     0.400000        21446         1.67
   26558.463     0.500000        26785         2.00
   29540.351     0.550000        29453         2.22
   31227.903     0.600000        32170         2.50
   31932.415     0.650000        34847         2.86
   32767.999     0.700000        37487         3.33
   34668.543     0.750000        40163         4.00
   36995.071     0.775000        41492         4.44
   39550.975     0.800000        42847         5.00
   41910.271     0.825000        44182         5.71
   44367.871     0.850000        45513         6.67
   46759.935     0.875000        46847         8.00
   48037.887     0.887500        47521         8.89
   49217.535     0.900000        48197        10.00
   49905.663     0.912500        48874        11.43
   50528.255     0.925000        49559        13.33
   50954.239     0.937500        50198        16.00
   51183.615     0.943750        50551        17.78
   51445.759     0.950000        50904        20.00
   51675.135     0.956250        51213        22.86
   52068.351     0.962500        51537        26.67
   53084.159     0.968750        51866        32.00
   53706.751     0.971875        52033        35.56
   54329.343     0.975000        52207        40.00
   54886.399     0.978125        52369        45.71
   55508.991     0.981250        52538        53.33
   56131.583     0.984375        52706        64.00
   56426.495     0.985938        52795        71.11
   56721.407     0.987500        52879        80.00
   57049.087     0.989062        52969        91.43
   57212.927     0.990625        53057       106.67
   57343.999     0.992188        53136       128.00
   57409.535     0.992969        53173       142.22
   57475.071     0.993750        53208       160.00
   57573.375     0.994531        53264       182.86
   57638.911     0.995313        53294       213.33
   57737.215     0.996094        53340       256.00
   57769.983     0.996484        53353       284.44
   57868.287     0.996875        53377       320.00
   57933.823     0.997266        53399       365.71
   57999.359     0.997656        53416       426.67
   58064.895     0.998047        53438       512.00
   58097.663     0.998242        53449       568.89
   58130.431     0.998437        53462       640.00
   58163.199     0.998633        53470       731.43
   58195.967     0.998828        53479       853.33
   58228.735     0.999023        53490      1024.00
   58261.503     0.999121        53499      1137.78
   58261.503     0.999219        53499      1280.00
   58294.271     0.999316        53509      1462.86
   58294.271     0.999414        53509      1706.67
   58327.039     0.999512        53518      2048.00
   58327.039     0.999561        53518      2275.56
   58327.039     0.999609        53518      2560.00
   58359.807     0.999658        53531      2925.71
   58359.807     0.999707        53531      3413.33
   58359.807     0.999756        53531      4096.00
   58359.807     0.999780        53531      4551.11
   58359.807     0.999805        53531      5120.00
   58359.807     0.999829        53531      5851.43
   58359.807     0.999854        53531      6826.67
   58392.575     0.999878        53537      8192.00
   58392.575     0.999890        53537      9102.22
   58392.575     0.999902        53537     10240.00
   58392.575     0.999915        53537     11702.86
   58392.575     0.999927        53537     13653.33
   58392.575     0.999939        53537     16384.00
   58392.575     0.999945        53537     18204.44
   58392.575     0.999951        53537     20480.00
   58392.575     0.999957        53537     23405.71
   58392.575     0.999963        53537     27306.67
   58392.575     0.999969        53537     32768.00
   58392.575     0.999973        53537     36408.89
   58392.575     0.999976        53537     40960.00
   58392.575     0.999979        53537     46811.43
   58425.343     0.999982        53538     54613.33
   58425.343     1.000000        53538          inf
#[Mean    =    29657.365, StdDeviation   =    11554.421]
#[Max     =    58392.576, Total count    =        53538]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  63752 requests in 1.00m, 26.50MB read
Requests/sec:   1062.49
Transfer/sec:    452.28KB